{
  "architectures": ["HuginnLoSATokForConditionalGeneration"],
  "model_type": "huginn_audio_raven_losatok_v1",
  "auto_map": {
    "AutoConfig": "raven_config_losatok.HuginnLoSATokConfig",
    "AutoModelForCausalLM": "raven_modeling_losatok.HuginnLoSATokForConditionalGeneration"
  },
  "losatok_root": "/hpc_stor03/sjtu_home/jinwei.zhang/models/LoSATok",
  "losatok_code_dir": "/hpc_stor03/sjtu_home/jinwei.zhang/code/GZbridge-huginn-full-finetune/code/huginn_lora/LosatokCode",
  "losatok_checkpoint_name": "losatok_kl1e-3.pth",
  "losatok_output_key": "unified_emb",
  "audio_encoder_hidden_size": 1280,
  "audio_sample_rate": 16000,
  "audio_target_token_count": 32,
  "audio_dynamic_tokens": false,
  "audio_max_token_count": 375,
  "audio_compressor_intermediate_size": 1536,
  "audio_compressor_kernel_size": 7,
  "audio_compressor_stride": 4,
  "audio_projector_hidden_size": 2048,
  "freeze_audio_encoder": true,
  "freeze_text_backbone": false,
  "use_audio_boundary_embeddings": true,
  "bias": false,
  "block_class_name": "SandwichBlock",
  "block_size": 4096,
  "bos_token_id": 65504,
  "eos_token_id": 65505,
  "head_dim": 96,
  "init_strategy": "takase",
  "init_values": {"embed_scale": 72.6636084983398, "embedding": 0.008703882797784892, "out_proj": 0.0005356869554443541, "std": 0.008703882797784892},
  "intermediate_size": 17920,
  "mean_backprop_depth": 8,
  "mean_recurrence": 32,
  "mlp_class_name": "GatedMLP",
  "n_embd": 5280,
  "n_heads": 55,
  "n_layers": 8,
  "n_layers_in_coda": 2,
  "n_layers_in_prelude": 2,
  "n_layers_in_recurrent_block": 4,
  "nonlin_name": "SiLU",
  "norm_class_name": "RMSNorm_llama",
  "norm_eps": 1e-06,
  "num_key_value_heads": 55,
  "pad_token_id": 65509,
  "padded_vocab_size": 65536,
  "padding_multiple": 4096,
  "qk_bias": true,
  "rope_base": 50000,
  "sampling_scheme": "poisson-lognormal-filling",
  "state_init": "like-init",
  "tie_embeddings": true,
  "torch_dtype": "bfloat16",
  "use_audio_boundary_embeddings": true,
  "vocab_size": 65536
}
